app/controllers/api/events_controller.rb

    def create
        registered_application = RegisterApp.find_by(url: request.env['HTTP_ORIGIN'])
        if registered_application.nil?
            render json: "Unregistered application", status: :unprocessable_entity
        else
            @event = registered_application.events.new(event_params)
                if @event.save
---
SELECT  "register_apps".* FROM "register_apps" WHERE "register_apps"."url" = ? LIMIT 1  [["url", "http://registered_application.com"]]
INSERT INTO "events" ("name", "register_app_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "index page loaded"], ["register_app_id", 6], ["created_at", "2017-11-02 17:23:39.438006"], ["updated_at", "2017-11-02 17:23:39.438006"]]