app/views/register_app/show.html.erb

        <li><%= name %> --> # of occurances <%= events.count %></li>
        <%= pie_chart @register_app.events.group(:name).count %>
---
SELECT "events".* FROM "events" WHERE "events"."register_app_id" = ?  [["register_app_id", 3]]
SELECT COUNT(*) AS count_all, (DATE_TRUNC('day', (created_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC' AS day FROM "events" WHERE "events"."register_app_id" = $1 AND (created_at IS NOT NULL) GROUP BY (DATE_TRUNC('day', (created_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC'  [["register_app_id", 2]]