app/controllers/register_app_controller.rb

SELECT "register_apps".* FROM "register_apps"
---
  def index
    @register_apps = RegisterApp.all

SELECT  "register_apps".* FROM "register_apps" WHERE "register_apps"."id" = ? LIMIT 1  [["id", 2]]
SELECT "events".* FROM "events" WHERE "events"."register_app_id" = ?  [[nil, 2]]
---
  def show
    @register_app = RegisterApp.find(params[:id])
    @events = @register_app.events.group_by(&:name)

INSERT INTO "register_apps" ("name", "url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "blockmarks"], ["url", "https://blocmarks-rtrunkhill.c9users.io"], ["user_id", 2], ["created_at", "2017-11-02 17:10:39.427479"], ["updated_at", "2017-11-02 17:10:39.427479"]]
---
  def create
    @register_app = RegisterApp.new
    @register_app.name = params[:register_app][:name]
    @register_app.url = params[:register_app][:url]
    @register_app.user_id = current_user.id

    if @register_app.save

SELECT  "register_apps".* FROM "register_apps" WHERE "register_apps"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @register_app = RegisterApp.find(params[:id])

SELECT  "register_apps".* FROM "register_apps" WHERE "register_apps"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "register_apps" SET "url" = ?, "updated_at" = ? WHERE "register_apps"."id" = ?  [["url", "http://registered_application.com"], ["updated_at", "2017-10-31 17:52:09.089322"], ["id", 6]]
---
  def update
    @register_app = RegisterApp.find(params[:id])
    @register_app.name = params[:register_app][:name]
    @register_app.url = params[:register_app][:url]

    if @register_app.save

SELECT  "register_apps".* FROM "register_apps" WHERE "register_apps"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "register_apps" WHERE "register_apps"."id" = ?  [["id", 3]]
---
  def destroy
    @register_app = RegisterApp.find(params[:id])

    if @register_app.destroy